tap "homebrew/bundle"

# utils
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "eza"
brew "stow"
brew "tmux"
brew "wget"

# command line utils
brew "htop"
brew "mupdf"
brew "ncdu"
brew "openjdk@17"
brew "pdftk-java"
brew "python@3.13"
brew "tldr"
brew "yazi"

# nvim
brew "fd"
brew "fzf"
brew "neovim"
brew "ripgrep"
brew "texlive"
cask "font-fira-code"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"

# git
brew "gh"
brew "git"
brew "git-lfs"
brew "hub"
brew "lazygit"

# Jekyll
brew "chruby"
brew "ruby-install"

# SageMath
# https://doc.sagemath.org/html/en/installation/source.html#sec-installation-from-sources
brew "autoconf"
brew "automake"
brew "bdw-gc"
brew "boost"
brew "bzip2"
brew "cddlib"
brew "cmake"
brew "curl"
brew "ecl"
brew "ffmpeg"
brew "flint"
brew "fplll"
brew "freetype"
brew "gcc"
brew "gd"
brew "gengetopt"
brew "gfortran"
brew "glpk"
brew "gmp"
brew "gnupg"
brew "gpatch"
brew "graphviz"
brew "gsl"
brew "imagemagick"
brew "libatomic_ops"
brew "libffi"
brew "libiconv"
brew "libmpc"
brew "libpng"
brew "libtool"
brew "maxima"
brew "meson"
brew "mpfi"
brew "mpfr"
brew "nauty"
brew "ncurses"
brew "ninja"
brew "ntl"
brew "openblas"
brew "openssl"
brew "pari"
brew "pari-elldata"
brew "pari-galdata"
brew "pari-galpol"
brew "pari-seadata"
brew "patchelf"
brew "pkg-config"
brew "ppl"
brew "primecount"
brew "primesieve"
brew "python-setuptools"
brew "python3"
brew "qhull"
brew "readline"
brew "singular"
brew "sqlite"
brew "suite-sparse"
brew "texinfo"
brew "tox"
brew "xz"
brew "zeromq"
brew "zlib"

# Casks
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "rectangle"
cask "skim"
cask "zoom"
cask "xournal++"
cask "owncloud"
