# utils
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "eza"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"

# command line utils
brew "htop"
brew "mupdf"
brew "ncdu"
brew "openjdk@17"
brew "pdftk-java"
brew "tlrc"
brew "yazi"

# nvim
brew "fd"
brew "fzf"
brew "neovim"
brew "node"
brew "ripgrep"
brew "tree-sitter-cli"
cask "font-fira-code"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"

# git
brew "gh"
brew "git"
brew "git-lfs"
brew "hub"
brew "lazygit"
brew "lighttpd"

# latex
brew "texlive"
brew "latexdiff"
brew "biber"

# Jekyll
brew "chruby"
brew "ruby-install"
brew "libyaml"

# general build tools
brew "autoconf"
brew "automake"
brew "cmake"
brew "curl"
brew "gcc"
brew "gfortran"
brew "gnupg"
brew "libtool"
brew "meson"
brew "ninja"
brew "openssl"
brew "pkg-config"
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# general utilities
brew "ffmpeg"
brew "graphviz"
brew "imagemagick"
brew "pandoc"

# Casks
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "discord"
cask "eqmac"
cask "fantastical"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "skim"
cask "todoist-app"
cask "utm"
cask "webex"
cask "whatsapp"

# Casks requiring password for installation
cask "fujitsu-scansnap-home"
cask "karabiner-elements"
cask "owncloud"
cask "zoom"
